AttendanceSheet/app/controllers/attendances_controller.rb

  def signin
    @attendance = current_user.attendances.signed_in_for(Date.today).first
    unless @attendance.blank?
      render :update do |page|
        page.replace_html "message", :text => "You have already signed in."
        page.visual_effect :highlight, 'message', :duration => 4.5
      end
    else
      @attendance = Attendance.create(:signin_datetime => Time.now.to_s(:db), :employee_id => current_user.id)
---
SELECT * FROM `attendances` WHERE (`attendances`.employee_id = 3) AND ((signin_datetime between '2009-10-14 00:00:00' and '2009-10-14 23:59:59') AND (`attendances`.employee_id = 3)) ORDER BY attendances.signin_datetime desc LIMIT 1
INSERT INTO `attendances` (`created_at`, `signout_datetime`, `updated_at`, `employee_id`, `signin_datetime`, `attendance_type_id`) VALUES('2009-10-13 22:11:47', NULL, '2009-10-13 22:11:47', NULL, '2009-10-13 22:11:47', NULL)

  def signout
    signed_in = current_user.attendances.signed_in_for(Date.today).first
    unless signed_in.blank?
      @attendance = current_user.attendances.signed_out_for(Date.today).first
      unless @attendance.blank?
        render :update do |page|
          page.replace_html "message", :text => "You have already signed out."
          page.visual_effect :highlight, 'message', :duration => 4.5
        end
      else
        @attendance = signed_in
        @attendance.update_attribute(:signout_datetime, Time.now.to_s(:db))
---
SELECT * FROM `attendances` WHERE (`attendances`.employee_id = 3) AND ((signout_datetime between '2009-10-14 00:00:00' and '2009-10-14 23:59:59') AND (`attendances`.employee_id = 3)) ORDER BY attendances.signin_datetime desc LIMIT 1
UPDATE `attendances` SET `updated_at` = '2009-10-13 23:09:48', `signout_datetime` = '2009-10-14 04:39:48' WHERE `id` = 10

  def load_attendances
    begin
      @employee_user = Employee.find_by_id(params[:employee_id] || current_user.id)
---
SELECT * FROM `employees` WHERE (`employees`.`id` = '1') LIMIT 1