AttendanceSheet/app/controllers/employees_controller.rb

SELECT count(*) AS count_all FROM `employees`
INSERT INTO `employee_details` (`address1`, `city`, `passport_number`, `address2`, `dob`, `created_at`, `address3`, `zip_code`, `country`, `updated_at`, `employee_id`, `last_name`, `marital_status`, `doj`, `first_name`, `middle_name`, `state`) VALUES(NULL, NULL, NULL, NULL, NULL, '2009-10-13 20:05:55', NULL, NULL, NULL, '2009-10-13 20:05:55', 3, 'Test', NULL, '2009-10-15 00:00:00', 'Test', NULL, NULL)
INSERT INTO `employees` (`salt`, `employee_role_id`, `created_at`, `crypted_password`, `updated_at`, `user_name`, `email`) VALUES('a5be06ce14b4d0533e184c9e91ea87051d822968', NULL, '2009-10-13 20:05:06', '053e4d1ec3bc02bdbbf1ea3d6c14091f1a4623ad', '2009-10-13 20:05:06', 'emp2', 'test@test.com')
---
  def create
    begin
      flash[:notice] = ""
      Employee.transaction do
        @employee = Employee.new(params[:employee])
        @employee.password_create = true
        @employee.employee_detail = @employee_detail = EmployeeDetail.new(params[:employee_detail])
        @employee.user_name = "emp#{Employee.count + 1}"
        @employee.valid?
        if @employee.valid? && @employee.save

SELECT * FROM `employees` WHERE (user_name = 'emp1' AND crypted_password = 'cf1f88da8bb73de110934c80c56f7657a49a4eff' ) LIMIT 1
---
  def load_employees
    @employees = Employee.find(:all)